---
type: Sweep
namespace: Autodesk.Revit.DB
version: 2024
members: 7
tags: [revit-api, class]
---

# Sweep

`Autodesk.Revit.DB.Sweep` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | IsTrajectorySegmentationEnabled | — | `public bool IsTrajectorySegmentationEnabled { get ; set ; }` |
| Property | MaxSegmentAngle | — | `public double MaxSegmentAngle { get ; set ; }` |
| Property | Parameter | — | `` |
| Property | Path3d | — | `public Path3d Path3d { get ; }` |
| Property | PathSketch | — | `public Sketch PathSketch { get ; }` |
| Property | ProfileSketch | — | `public Sketch ProfileSketch { get ; }` |
| Property | ProfileSymbol | — | `public FamilySymbolProfile ProfileSymbol { get ; }` |